# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

In [7]:
# Import pandas
import pandas as pd

In [16]:
# Create a series of three different colours
Colours = pd.Series(['Read', "Gray", "Black"])

In [10]:
# View the series of different colours
Colours

0    Black
1     Gray
2     Read
dtype: object

In [17]:
# Create a series of three different car types and view it
Cars = pd.Series(["Lamborghini", "Bugatti", "BMW"])
Cars

0    Lamborghini
1        Bugatti
2            BMW
dtype: object

In [18]:
# Combine the Series of cars and colours into a DataFrame
CarDataFrame = pd.DataFrame({"Cars" : Cars, "Colours" : Colours})
CarDataFrame

          Cars Colours
0  Lamborghini    Read
1      Bugatti    Gray
2          BMW   Black

In [35]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
Car_sales = pd.read_csv("car-sales.csv")
Car_sales

,Unnamed: 0.1,Unnamed: 0,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel par 100KM,peetrrol kitna pea?,Passed Safty test
0,0,0,Toyota,white,150043,4,"$4,000.00",5.0,7.5,11253.225,True
1,1,1,Honda,red,87899,4,"$5,000.00",5.0,9.2,8086.708,True
2,2,2,Toyota,blue,32549,3,"$7,000.00",5.0,5.0,1627.450,True
3,3,3,BMW,black,11179,5,"$22,000.00",5.0,9.6,1073.184,True
4,4,4,Nissan,white,213095,4,"$3,500.00",5.0,8.7,18539.265,True
5,5,5,Toyota,green,99213,4,"$4,500.00",5.0,4.7,4663.011,True
6,6,6,Honda,blue,45698,4,"$7,500.00",5.0,7.6,3473.048,True
7,7,7,Honda,blue,54738,4,"$7,000.00",5.0,7.6,4160.088,True
8,8,8,Toyota,white,60000,4,"$6,250.00",5.0,8.7,5220.000,True
9,9,9,Nissan,white,31600,4,"$9,700.00",5.0,8.7,2749.200,True

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [23]:
# Export the DataFrame you created to a .csv file
CarDataFrame.to_csv("cardataframe.csv", index=False)

In [24]:
# Find the different datatypes of the car data DataFrame
CarDataFrame.dtypes

Cars       object
Colours    object
dtype: object

In [25]:
# Describe your current car sales DataFrame using describe()
CarDataFrame.describe()

               Cars Colours
count             3       3
unique            3       3
top     Lamborghini    Read
freq              1       1

In [26]:
# Get information about your DataFrame using info()
CarDataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Cars     3 non-null      object
 1   Colours  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

What does it show you?

In [28]:
# Create a Series of different numbers and find the mean of them
NumberSeries = pd.Series([1,2,46,323,35,2323,4,234,134])
NumberSeries.mean()

np.float64(344.6666666666667)

In [29]:
# Create a Series of different numbers and find the sum of them
NumberSeries.sum()

np.int64(3102)

In [33]:
# List out all the column names of the car sales DataFrame
CarDataFrame['Cars']

0    Lamborghini
1        Bugatti
2            BMW
Name: Cars, dtype: object

In [37]:
# Find the length of the car sales DataFrame
lan(Car_sales["Cars"])

NameError: name 'lan' is not defined

In [38]:
# Show the first 5 rows of the car sales DataFrame
Car_sales.head(5)

,Unnamed: 0.1,Unnamed: 0,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel par 100KM,peetrrol kitna pea?,Passed Safty test
0,0,0,Toyota,white,150043,4,"$4,000.00",5.0,7.5,11253.225,True
1,1,1,Honda,red,87899,4,"$5,000.00",5.0,9.2,8086.708,True
2,2,2,Toyota,blue,32549,3,"$7,000.00",5.0,5.0,1627.450,True
3,3,3,BMW,black,11179,5,"$22,000.00",5.0,9.6,1073.184,True
4,4,4,Nissan,white,213095,4,"$3,500.00",5.0,8.7,18539.265,True

In [39]:
# Show the first 7 rows of the car sales DataFrame
Car_sales.head(7)

,Unnamed: 0.1,Unnamed: 0,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel par 100KM,peetrrol kitna pea?,Passed Safty test
0,0,0,Toyota,white,150043,4,"$4,000.00",5.0,7.5,11253.225,True
1,1,1,Honda,red,87899,4,"$5,000.00",5.0,9.2,8086.708,True
2,2,2,Toyota,blue,32549,3,"$7,000.00",5.0,5.0,1627.450,True
3,3,3,BMW,black,11179,5,"$22,000.00",5.0,9.6,1073.184,True
4,4,4,Nissan,white,213095,4,"$3,500.00",5.0,8.7,18539.265,True
5,5,5,Toyota,green,99213,4,"$4,500.00",5.0,4.7,4663.011,True
6,6,6,Honda,blue,45698,4,"$7,500.00",5.0,7.6,3473.048,True

In [40]:
# Show the bottom 5 rows of the car sales DataFrame
Car_sales.tail(5)

,Unnamed: 0.1,Unnamed: 0,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel par 100KM,peetrrol kitna pea?,Passed Safty test
5,5,5,Toyota,green,99213,4,"$4,500.00",5.0,4.7,4663.011,True
6,6,6,Honda,blue,45698,4,"$7,500.00",5.0,7.6,3473.048,True
7,7,7,Honda,blue,54738,4,"$7,000.00",5.0,7.6,4160.088,True
8,8,8,Toyota,white,60000,4,"$6,250.00",5.0,8.7,5220.000,True
9,9,9,Nissan,white,31600,4,"$9,700.00",5.0,8.7,2749.200,True

In [41]:
# Use .loc to select the row at index 3 of the car sales DataFrame
Car_sales.loc(3)

ValueError: No axis named 3 for object type DataFrame

In [42]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
Car_sales.iloc(3)

ValueError: No axis named 3 for object type DataFrame

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [43]:
# Select the "Odometer (KM)" column from the car sales DataFrame
Car_sales['Odometer (KM)']

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [44]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
Car_sales['Odometer (KM)'].mean()

np.float64(78601.4)

In [48]:
# Select the rows with over 100,000 kilometers on the Odometer
(Car_sales['Odometer (KM)'][1] > 100000

_IncompleteInputError: incomplete input (2364280485.py, line 2)

In [23]:
# Create a crosstab of the Make and Doors columns

In [24]:
# Group columns of the car sales DataFrame by the Make column and find the average

In [25]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline

In [26]:
# Create a histogram of the Odometer column using hist()

In [27]:
# Try to plot the Price column using plot()

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string column to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [28]:
# Remove the punctuation from price column

In [29]:
# Check the changes to the price column

In [30]:
# Remove the two extra zeros at the end of the price column

In [31]:
# Check the changes to the Price column

In [32]:
# Change the datatype of the Price column to integers

In [33]:
# Lower the strings of the Make column

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [34]:
# Make lowering the case of the Make column permanent

In [35]:
# Check the car sales DataFrame

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [36]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")


# Check out the new DataFrame

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [37]:
# Fill the Odometer column missing values with the mean of the column inplace

In [38]:
# View the car sales missing DataFrame and verify the changes

In [39]:
# Remove the rest of the missing data inplace

In [40]:
# Verify the missing values are removed by viewing the DataFrame

We'll now start to add columns to our DataFrame.

In [41]:
# Create a "Seats" column where every row has a value of 5

In [42]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame

In [43]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame

In [44]:
# Remove the last column you added using .drop()

In [45]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [46]:
# Reset the indexes of the shuffled DataFrame

Notice the index numbers have been changed to have order (start from 0).

In [47]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame

In [48]:
# Change the title of the Odometer (KM) to represent miles instead of kilometers

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.